Repository: ndea-wc/nordea-eramaksu-for-woocommerce
Catalog: languages/nordea-eramaksu-for-woocommerce-*.po
Languages: fi

source: Enable payments via Nordea Erämaksu
fi: Ota maksut käyttöön Nordea Erämaksun kautta

source: Enable/Disable
fi: Päällä / Pois

source: Enable Nordea Erämaksu
fi: Ota Nordea Erämaksu käyttöön

source: Title
fi: Otsikko

source: Description
fi: Kuvaus

source: API Client ID
fi: API-asiakkaan tunnus (Client ID)

source: API Client Secret
fi: API-asiakkaan salainen avain (Client Secret)

source: Dealer ID
fi: Kauppiastunnus (Dealer ID)

source: Order ID Prefix
fi: Tilaustunnuksen etuliite

source: Payment error: Missing required gateway credentials.
fi: Maksuvirhe: Vaaditut yhdyskäytävän tunnistetiedot puuttuvat.

source: Payment error: Total value for Nordea Erämaksu must be between %1$s€ and %2$s€.
fi: Maksuvirhe: Nordea Erämaksun kokonaissumman on oltava välillä %1$s–%2$s euroa.

source: Payment error: Unable to connect to Nordea. Please check your credentials and try again.
fi: Maksuvirhe: Nordeaan ei saada yhteyttä. Tarkista kirjautumistietosi ja yritä uudelleen.

source: Payment error: Application reference id or redirect url not returned.
fi: Maksuvirhe: Hakemuksen viitetunnusta tai uudelleenohjauksen URL-osoitetta ei palutettu.

source: Payment error: Bad or invalid request
fi: Maksuvirhe: Virheellinen pyyntö

source: Payment error: Invalid authentication headers
fi: Maksuvirhe: Virheelliset todennustiedot

source: Payment error: Unauthorized or invalid dealer id
fi: Maksuvirhe: Virheellinen kauppiastunnus

source: Payment error: Internal Server Error
fi: Maksuvirhe: Nordean sisäinen palvelinvirhe

source: Payment error: Payment method unavailable
fi: Maksuvirhe: Maksutapa ei ole käytettävissä

source: Payment error: Service unavailable
fi: Maksuvirhe: Palvelu ei ole käytettävissä

source: Payment error: Unknown error
fi: Maksuvirhe: Tuntematon virhe

source: Payment error: Nordea Erämaksu cannot be used for non EUR purchases.
fi: Maksuvirhe: Nordea Erämaksua ei voi käyttää muihin kuin euromääräisiin ostoksiin.

source: Awaiting payment confirmation from Nordea.
fi: Odottaa maksuvahvistusta Nordeasta.

source: Payment error: Please retry.
fi: Maksuvirhe: Yritä uudelleen.

source: Payment application completed successfully.
fi: Rahoitushakemus suoritettu onnistuneesti.

source: Payment application decision is pending.
fi: Rahoituspäätös on vireillä.

source: Payment application was rejected by Nordea.
fi: Nordea hylkäsi rahoitushakemuksen.

source: Payment application failed due to a technical issue with Nordea.
fi: Rahoitushakemus epäonnistui Nordean kanssa ilmenneen teknisen ongelman vuoksi.

source: Payment application status
fi: Rahoitushakemuksen tila

source: Payment verification error: Unable to verify payment
fi: Maksun vahvistusvirhe: Maksua ei voida vahvistaa

source: Payment verification error: Bad or invalid request
fi: Maksun vahvistusvirhe: Virheellinen pyyntö

source: Payment verification error: Invalid authentication headers
fi: Maksun vahvistusvirhe: Virheelliset todennustiedot

source: Payment verification error: Unauthorized or invalid dealer id
fi: Maksun vahvistusvirhe: Virheellinen kauppiastunnus

source: Payment verification error: Finance application not found
fi: Maksun vahvistusvirhe: Rahoitushakemusta ei löydy

source: Payment verification error: Internal Server Error
fi: Maksun vahvistusvirhe: Sisäinen palvelinvirhe

source: Payment verification error: Method not implemented
fi: Maksun vahvistusvirhe: Menetelmää ei ole otettu käyttöön

source: Payment verification error: Service unavailable
fi: Maksun vahvistusvirhe: Palvelu ei ole käytettävissä

source: Payment verification error: Unknown error
fi: Maksun vahvistusvirhe: Tuntematon virhe

source: Payment verification error: Unexpeted error
fi: Maksun vahvistusvirhe: Odottamaton virhe

source: Succesfully moved Nordea Erämaksu payment to invoicing.
fi: Nordea Erämaksu on siirretty laskutukseen.

source: Failed to move Nordea Erämaksu payment to invoicing. Nordea API error:
fi: Nordea Erämaksun siirtäminen laskutukseen epäonnistui. Nordea API virhe:

source: Cancelled Nordea Erämaksu installment payment.
fi: Nordea Erämaksu rahoitus peruttu.

source: Failed to cancel Nordea Erämaksu installment payment. Nordea API error:
fi: Nordea Erämaksu rahoituksen peruminen epäonnistui. Nordea API virhe:

source: The refund amount must be larger than 1 EUR.
fi: Hyvityksen määrän on oltava suurempi kuin 1 EUR.

source: Refunded Nordea Erämaksu installment payment. Refunded amount:
fi: Hyvitetty Nordean Erämaksun osamaksua. Hyvityksen määrä:

source: Nordea API error in refund:
fi: Nordean API-virhe hyvityksessä:

source: Nordea Custom Text
fi: Nordean mukautettu teksti

source: This is a custom text displayed in the Nordea payment gateway settings.
fi: Tämä on mukautettu teksti, joka näkyy Nordean maksuyhdyskäytävän asetuksissa.

source: Nordea Continue Shopping URL
fi: Jatka ostoksia URL-osoite

source: This is the URL for the "Continue Shopping" link displayed when the payment option is disabled.
fi: Tämä on Jatka ostoksia -linkin URL-osoite, joka näytetään, kun maksutapa on poistettu käytöstä.

source: Continue Shopping Text
fi: Jatka ostoksia linkkiteksti

source: This is the text displayed for the "Continue Shopping" link.
fi: Tämä on mukautettu teksti, joka näkyy Nordea Erämaksun maksutavassa kun ostos on alle tai yli rajojen.

source: Start Range
fi: Rahjoituksen alaraja

source: The starting value of the range.
fi: Rahoituksen alaraja, minimi 500€.

source: End Range
fi: Rahoituksen yläraja

source: The ending value of the range.
fi: Rahoituksen yläraja, maksimi 30.000€.

source: Payment error: Payment cancelled
fi: Maksuvirhe: Maksu peruutettu

source: Payment error: Payment failed
fi: Maksuvirhe: Maksu epäonnistui

source: Payment application completed successfully. Order status updated to processing by REST API notification.
fi: Rahoitushakemus jätetty onnistuneesti. Tilauksen tila päivitetty käsittelyyn REST API ilmoituksella.

source: Nordea Finance notification. Payment application decision is pending.
fi: Nordea Rahoituksen ilmoitus. Rahoitushakemus on vireillä.

source: Nordea Finance notification. Payment application was rejected by Nordea.
fi: Nordea Rahoituksen ilmoitus. Nordea hylkäsi rahoitushakemuksen.

source: Nordea Finance notification. Payment application failed due to a technical issue with Nordea.
fi: Nordea Rahoituksen ilmoitus. Rahoitushakemus epäonnistui Nordean kanssa ilmenneen teknisen ongelman vuoksi.

source: Nordea Finance notification. Payment application status changed to
fi: Nordea Rahoituksen ilmoitus. Rahoitushakemuksen tilaksi on muutettu

source: Nordea Finance Erämaksu Payment Gateway.
fi: Nordea Finance Erämaksun maksuyhdyskäytävä.
